public_html/AR/18.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="it" xml:lang="it">
<head>
<!-- 2022-03-06 dom 22:41 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>AR - Lesson 18</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Alessandro Straziota" />
<link rel="stylesheet" href="/appunti.css" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href=""> UP </a>
 |
 <a accesskey="H" href="/"> HOME </a>
</div><div id="content">
<h1 class="title">AR - Lesson 18</h1>
<div id="table-of-contents">
<h2>Indice</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org35ad6e0">Link Analysis and Web Search</a>
<ul>
<li><a href="#orgdbfe33c">HITS: Hubs and Authorities</a></li>
</ul>
</li>
<li><a href="#orgf7ce6c9">Appendice</a>
<ul>
<li><a href="#orga195ac5">Autovalori e Autovettori</a></li>
<li><a href="#orgbf68620">Base</a></li>
<li><a href="#org8837e0c">Vettore Normale</a></li>
<li><a href="#org475be41">Vettore Ortogonale</a></li>
<li><a href="#org73af630">Base Ortonormale</a></li>
<li><a href="#org7bd1352">Matrice Semidefinita Positiva</a></li>
<li><a href="#orgbc128f4">Teorema <code>A</code></a></li>
<li><a href="#orgf30427c">Teorema <code>B</code></a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org35ad6e0" class="outline-2">
<h2 id="org35ad6e0">Link Analysis and Web Search</h2>
<div class="outline-text-2" id="text-org35ad6e0">
</div>
<div id="outline-container-orgdbfe33c" class="outline-3">
<h3 id="orgdbfe33c">HITS: Hubs and Authorities</h3>
<div class="outline-text-3" id="text-orgdbfe33c">
<p>
Ricapitolando, una volta individuato un sottoinsieme di pagine inerenti alla nostra ricerca, consideriamo maggiormente rilevanti quelle pagine che sono molto puntate (o <b>indicizzate</b>) all'interno dell'insieme.<br />
</p>

<p>
Purtroppo però potrebbe capitare che una pagina venga puntata da tantissime pagine che in realtà sono molto poco rilevanti ai fini della ricerca.
Oppure ancora, un utente malevolo a scopi egoistici potrebbe creare tante pagine fittizie che puntano alle sue pagine per avere più rilevanza.<br />
</p>

<p>
Perciò è utile porsi il seguente questio:
</p>
<blockquote>
<p>
<i>quando e quanto una pagina è <b>autorevole</b> nel conferire rilevanza ad un'altra pagina che punta?</i>
</p>
</blockquote>

<p>
L'algoritmo <b>Hyperlink-Induced Topic Search</b> (o <b>HITS</b>, noto anche come <b>Hubs &amp; Authorities</b>) proposto da <a href="https://it.wikipedia.org/wiki/Jon_Kleinberg">Jon Kleinberg</a> consente di valutare la rilevanza delle pagine in funzione dei link che la puntano.<br />
</p>

<p>
Iniziamo con l'associare ad ogni pagina due <b>indici</b>:
</p>
<ul class="org-ul">
<li>un indice di <b>autorità</b> che esprime la <span class="underline">rilevanza</span> della pagina ai fini della ricerca.</li>
<li>un indice di <b>hub</b> che invece esprime l' <span class="underline">autorevolezza</span> della pagina a conferire autorità alle pagine alle quali punta.</li>
</ul>

<p>
Per ogni pagina \(i\) della rete indichiamo con \(a_i\) il suo valore di <b>autorità</b>, come il numero di pagine (nell'insieme di pagine attinenti alla ricerca) che puntano ad \(i\).
\[
   a_i = \vert \{ j : j \mbox{ è attinente alla ricerca} \land j \rightarrow i \} \vert
   \]
Con \(j \rightarrow i\) stiamo ad indicare che la pagina \(j\) punta alla pagina \(i\).<br />
</p>

<p>
Assumiamo che a fronte di una ricerca otteniamo un sottoinsieme di \(n\) pagine, indichiamo con \(M\) la <span class="underline">matrice di adiacenza</span> del sottografo indotto dalle \(n\) pagine inerenti alla ricerca.
\[
   M\left[i,j \right] = \begin{cases}
     1 &\mbox{se } i \rightarrow j\\
     0 &\mbox{altrimenti}
   \end{cases}\;\;
   \forall 1 \leq i < j \leq n
   \]
Definendo in questa maniera \(M\) avremo che
\[
   a_i = \sum_{j = 1}^{n} M\left[j,i \right]
   \]
</p>

<p>
Indichiamo invece con \(h_i\) l'indice di hub di una pagina \(i\).
Tale indice potremmo definirlo come il numero di pagine (sempre all'interno del sottoinsieme di nodi inerenti alla ricerca) alle quali \(i\) punta.
Ovvero
</p>
\begin{align*}
  h_i &= \vert \{ j : j \mbox{ è attinente alla ricerca} \land j \leftarrow i \} \vert\\
  h_i &= \sum_{j = 1}^{n} M\left[i,j \right]
\end{align*}

<p>
Partiamo con l'osservare che possiamo <i>raffinare</i> i due indici appena definiti tramite le seguenti idee:
</p>
<ul class="org-ul">
<li>il valore di autorità di una pagina \(i\) dovrebbe essere tanto più eleveto quanto più sono <b>autorevoli</b> le pagine \(j\) che la puntano.</li>
<li>simmetricamente, il valore di hub di una pagina \(i\) dovrebbe essere tanto più elevato quanto più è elevata la <b>rilevanza</b> delle pagine \(j\) a cui punta.</li>
</ul>

<p>
Se in qualche modo ci venisse suggerito un valore di hub iniziale \(h^{(0)}_i\) potremmo raffinare il valore \(a_i\) visto in precedenza nella seguente maniera
\[
     a^{(1)}_i = \sum_{j = 1}^{n} M\left[j,i \right] \cdot h^{(0)}_j
   \]
Ovvero l'autorità \(a^{(1)}_i\) è influenzata dall'autorevolezza delle \(j\) che la puntano.
</p>

<p>
Dato che quindi l'indice di autorità è modificato, possiamo raffinare anche \(h^{(0)}_i\) alla stessa maniera.
\[
     h^{(1)}_i = \sum_{j = 1}^{n} M\left[i,j \right] \cdot a^{(1)}_j
   \]
</p>

<p>
Possiamo quindi applicare questo <b>metodo iterativo</b> per raffinare al meglio gli indici di autorità e di hub
</p>
\begin{align*}
  a^{(k+1)}_i &= \sum_{j = 1}^{n} M\left[j,i \right] \cdot h^{(k)}_j\\
  h^{(k+1)}_i &= \sum_{j = 1}^{n} M\left[i,j \right] \cdot a^{(k+1)}_j
\end{align*}
<p>
oppure in forma compatta
</p>
\begin{align*}
  a^{(k+1)}_i &= M^T h^{(k)}\\
  h^{(k+1)}_i &= M a^{(k+1)}
\end{align*}
<p>
e ponendo (in maniera del tutto convenzionale) \(h^{(0)} = \underline{1}\).<br />
</p>

<p>
Ciò che vogliamo è ottenere ad ongi iterazione che i valori di autorità e di hub descrivano <span class="underline">meglio rispetto all'iterazione precedente</span> la rilevanza di una pagina nella ricerca.
Ciò che cerchiamo è quindi una sorta di "convergenza" ai valori reali di autorità e di hub.<br />
</p>

<p>
Innanzitutto non possiamo parlare di convergenza vera e propria in quanto ogni volta sommiamo valori non negativi.
Perciò considereremo una convergenza in presenza di una <b>opportuna normalizzazione</b>.<br />
</p>

<p>
Poi, per ottenere convergenza, è necessario che ad ogni iterazione si ottiene un risultato sempre migliore rispetto a quella precedente.
Perciò non vogliamo che accada una situazione del tipo
\[
   \exists i,j : a^{(k)}_i > a^{(k)}_j, \;\; a^{(k+1)}_i < a^{(k+1)}_j, \;\; a^{(k+2)}_i > a^{(k+2)}_j, \;\; ...
   \]
</p>

<blockquote>
<p>
<b>THM</b><br />
Comunque si scelga un vettore iniziale \(h^{(0)}\) con valori <span class="underline">positivi</span>, esiste un valore \(c \in \mathbb{R}^+\) e un vettore \(z \in \mathbb{R}^n\) <span class="underline">non nullo</span> tali che
\[
   \lim_{k \rightarrow \infty} \frac{h^{(k)}}{c^k} = z
   \]
</p>
</blockquote>

<blockquote>
<p>
<b>Proof</b>:<br />
<b>[DA FINIRE&#x2026;]</b>
</p>
</blockquote>

<hr />
</div>
</div>
</div>
<div id="outline-container-orgf7ce6c9" class="outline-2">
<h2 id="orgf7ce6c9">Appendice</h2>
<div class="outline-text-2" id="text-orgf7ce6c9">
</div>
<div id="outline-container-orga195ac5" class="outline-3">
<h3 id="orga195ac5">Autovalori e Autovettori</h3>
<div class="outline-text-3" id="text-orga195ac5">
<p>
Data una matrice \(A \in \mathbb{C}^{n \times n}\), un vettore \(x \in \mathbb{C}^n\) tale che \(x \neq \overline{0}\) e un valore \(\lambda \in \mathbb{C}\), diremo che essi sono rispettivamente un <b>autovettore</b> e relativo <b>autovalore</b> della matrice \(A\) se
\[
   Ax = \lambda x
   \]
ovvero se
\[
   (A - \lambda I)x = 0
   \]
</p>
</div>
</div>

<div id="outline-container-orgbf68620" class="outline-3">
<h3 id="orgbf68620">Base</h3>
<div class="outline-text-3" id="text-orgbf68620">
<p>
Una base per uno spazio vettoriale \(\mathbb{R}^n\) è un inseme di \(n\) vettori \(z_1, ..., z_n \in \mathbb{R}^n\) tali che ogni altro vettore \(x \in \mathbb{R}^n\) può essere espresso come una <b>combinazione lineare</b> della base, ovver
\[
   \forall x \in \mathbb{R}^n \exists p \in \mathbb{R}^n : x = \sum_{i = 1}^{n} p_i \cdot z_i
   \]
</p>
</div>
</div>

<div id="outline-container-org8837e0c" class="outline-3">
<h3 id="org8837e0c">Vettore Normale</h3>
<div class="outline-text-3" id="text-org8837e0c">
<p>
Dato un vettore \(z \in \mathbb{R}^n\) esso si dice <b>normale</b> se
\[
   z \cdot z = z_1^2 + z_2^2 + ... + z_n^2 = 1
   \]
</p>
</div>
</div>

<div id="outline-container-org475be41" class="outline-3">
<h3 id="org475be41">Vettore Ortogonale</h3>
<div class="outline-text-3" id="text-org475be41">
<p>
Dati due vettori \(z_i,z_j \in \mathbb{R}^n\) essi si dice <b>ortogonali</b> se
\[
   z_i \cdot z_j = z_{i1}z_{j1} +  z_{i2}z_{j2} + ... +  z_{in}z_{jn} = 0
   \]
</p>
</div>
</div>

<div id="outline-container-org73af630" class="outline-3">
<h3 id="org73af630">Base Ortonormale</h3>
<div class="outline-text-3" id="text-org73af630">
<p>
Data una base \(z = (z_1, ..., z_n) \in \mathbb{R}^{n \times n}\) se tutti i vettori sono normali e reciprocamente ortogonali, ovvero se
</p>
\begin{align*}
  \forall i = 1, ..., n &: z_i \cdot z_i = z_{i1}^2 + z_{i2}^2 + ... + z_{in}^2 = 1\\
  \forall i \neq j &: z_i \cdot z_j = z_{i1}z_{j1} +  z_{i2}z_{j2} + ... +  z_{in}z_{jn} = 0
\end{align*}
</div>
</div>

<div id="outline-container-org7bd1352" class="outline-3">
<h3 id="org7bd1352">Matrice Semidefinita Positiva</h3>
<div class="outline-text-3" id="text-org7bd1352">
<p>
Una matrice \(A\) \(n \times n\) è detta <b>semidefinita positiva</b> se
\[
   \forall x \in \mathbb{R}^n : x^T A x \geq 0
   \]
</p>
</div>
</div>

<div id="outline-container-orgbc128f4" class="outline-3">
<h3 id="orgbc128f4">Teorema <code>A</code></h3>
<div class="outline-text-3" id="text-orgbc128f4">
<p>
Se \(A\) è una matrice a valori <span class="underline">tutti reali</span> e <span class="underline">simmetrica</span>, ovvero \(A = A^T\), allora \(A\) avrà \(n\) autovalori ed \(n\) autovettori reali e distinti, e inoltre tali autovalori formano una base per \(\mathbb{R}^n\).
</p>
</div>
</div>

<div id="outline-container-orgf30427c" class="outline-3">
<h3 id="orgf30427c">Teorema <code>B</code></h3>
<div class="outline-text-3" id="text-orgf30427c">
<p>
Se \(A\) è una matrice <span class="underline">semidefinita positiva</span> allora:
</p>
<ol class="org-ol">
<li>gli autovalori di \(A\) sono <span class="underline">non negativi</span>.</li>
<li>se \(A\) è non nulla, ovvero \(A \neq \underline{0}\), allora \(A\) avrà almeno un autovalore \(\lambda > 0\) <span class="underline">strettamente positivo</span>.</li>
</ol>

<hr />
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Data: 2021-12-13 lun 00:00</p>
<p class="author">Autore: Alessandro Straziota</p>
<p class="email">Email: <a href="mailto:alessandrostr95@gmail.com">alessandrostr95@gmail.com</a></p>
<p class="date">Created: 2022-03-06 dom 22:41</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
